run/OFW2025/case1/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/caseInfo"

convertToMeters 1;

vertices
(
    ($x1 0 $z2)
    ($x2 0 $z2)
    ($x2 $y $z2)
    ($x1 $y $z2)
    ($x1 0 $z1)
    ($x2 0 $z1)
    ($x2 $y $z1)
    ($x1 $y $z1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx 1 $nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    seaBed
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }

    frontBack
    {
        type empty;
        faces
        (
            (3 7 6 2)
            (0 1 5 4)
        );
    }

    soilDomainBottom
    {
        type wall;
        faces
        (
            (0 3 2 1 )
        );
    }

    sides
    {
        type cyclic;
        faces
        (
            (0 4 7 3)
            (1 5 6 2)
        );

    }
);


mergePatchPairs
(
);

// ************************************************************************* //
